---
kind: property
id: P:Autodesk.Revit.DB.Structure.FabricSheetType.MajorLayoutPattern
source: html/19be065b-cbae-e934-09bc-216cc240795c.htm
---
# Autodesk.Revit.DB.Structure.FabricSheetType.MajorLayoutPattern Property

The layout pattern in the major direction.

## Syntax (C#)
```csharp
public FabricSheetLayoutPattern MajorLayoutPattern { get; }
```